Database_part_of_the_project/app/controllers/places_controller.rb

SELECT "places".* FROM "places" WHERE "places"."name" = $1 AND "places"."continent" = $2  [["name", "Sofia"], ["continent", "Asia"]]
---
	def show
			@place=Place.where(name: params[:name],continent: params[:continent])