Database_part_of_the_project/app/controllers/places_controller.rb

	def create
		if !Place.exists?(params[:name])
			@place= Place.new
			@place.name=params[:name]
			@place.continent = params[:continent]
			@place.longitude=params[:longitude]
			@place.latitude=params[:latitude]
			@place.country =params[:country]
			@place.web_info = params[:web_info]
@place.save
---
INSERT INTO "places" ("name", "continent", "longitude", "latitude", "country", "web_info", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def show
			if params.has_key?(:continent)
				@place = Place.where(continent: params[:continent])
			else
				@place=Place.all
			end

			prng = Random.new
			num = prng.rand(@place.count)
---
SELECT "places".* FROM "places" WHERE (Sofia)
SELECT COUNT(*) FROM "places"